In [1]:
%load_ext sql

In [ ]:
# Mysql connection url
`%sql mysql+pymysql://{USER}:{PASSWORD}@{HOST}:{PORT}/{DATABASE}`

In [2]:
%sql sqlite:///chinook.db

In [5]:
%%sql 

SELECT
    FirstName,
    LastName,
    HireDate
FROM 
    employees;

 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]

In [4]:
%%sql

SHOW TABLES;

 * sqlite:///chinook.db
(sqlite3.OperationalError) near "SHOW": syntax error
[SQL: SHOW TABLES;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)